tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    igloo_region0
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    twoFridgeFreezers_seal_0
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    twoFridgeFreezers_herring_1
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
}

// ************************************************************************* //
