tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    maxY
    {
        type            empty;
        nFaces          0;
        startFace       60436;
    }
    minX
    {
        type            empty;
        nFaces          0;
        startFace       60436;
    }
    maxX
    {
        type            empty;
        nFaces          0;
        startFace       60436;
    }
    minY
    {
        type            empty;
        nFaces          0;
        startFace       60436;
    }
    ground
    {
        type            wall;
        nFaces          590;
        startFace       60436;
    }
    maxZ
    {
        type            empty;
        nFaces          0;
        startFace       61026;
    }
    igloo_region0
    {
        type            wall;
        nFaces          2260;
        startFace       61026;
    }
    twoFridgeFreezers_seal_0
    {
        type            wall;
        nFaces          1344;
        startFace       63286;
    }
    twoFridgeFreezers_herring_1
    {
        type            wall;
        nFaces          1116;
        startFace       64630;
    }
)

// ************************************************************************* //
